IMS/main.html
<?xml version="1.0" encoding="utf-8"?>
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-12-21 Sat 14:58 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Modelování a simulace</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Kamil Vojanec" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Modelování a simulace</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgc406135">1. Úvod</a>
<ul>
<li><a href="#org3f7681f">1.1. Základní pojmy</a>
<ul>
<li><a href="#orgfa0e525">1.1.1. Systém</a></li>
<li><a href="#orgb757827">1.1.2. Model</a></li>
<li><a href="#orgdd61d3e">1.1.3. Modelování</a></li>
<li><a href="#orgd9b98ff">1.1.4. Simulace</a></li>
</ul>
</li>
<li><a href="#org6933fef">1.2. Základní etapy modelování a simulace</a></li>
<li><a href="#orgd7f83cb">1.3. Formální definice systému</a>
<ul>
<li><a href="#org489828f">1.3.1. \(U\) je konečná množina prvků systému:</a></li>
<li><a href="#org256f0ec">1.3.2. Prvek systému \(u = (X, Y)\):</a></li>
<li><a href="#org9beb117">1.3.3. Charakteristika systému \(R\) je množina všech propojení</a></li>
<li><a href="#orgb367a7b">1.3.4. Propojení prvku \(u_i\) s prvkem \(u_j\):</a></li>
</ul>
</li>
<li><a href="#orgbce2aab">1.4. Čas</a></li>
<li><a href="#org9c95e80">1.5. Časová množina</a></li>
<li><a href="#org33a66b1">1.6. Chování systému</a></li>
<li><a href="#org986f611">1.7. Okolí systému</a></li>
<li><a href="#orgc5a0d2a">1.8. Klasifikace prvků systémů</a>
<ul>
<li><a href="#orgc4f6914">1.8.1. Klasifikace 1</a></li>
<li><a href="#orgdc7d149">1.8.2. Klasifikace 2</a></li>
</ul>
</li>
<li><a href="#org57181fd">1.9. Klasifikace systémů</a>
<ul>
<li><a href="#org049b5d6">1.9.1. Klasifikace 1</a></li>
<li><a href="#orgc8f182c">1.9.2. Klasifikace 2</a></li>
</ul>
</li>
<li><a href="#orgdc46ba1">1.10. Simulace</a></li>
<li><a href="#org43d5f44">1.11. Typy simulace podle modelu</a></li>
<li><a href="#orgf8f5f2a">1.12. Typy simulace podle simulátoru</a></li>
<li><a href="#orgca5ec28">1.13. Verifikace modelu</a></li>
<li><a href="#org06be5ff">1.14. Validace modelu</a></li>
</ul>
</li>
<li><a href="#org55cf6ab">2. Modely</a>
<ul>
<li><a href="#org42e844c">2.1. Abstraktní model</a></li>
<li><a href="#orgd562cb5">2.2. Simulační model</a></li>
<li><a href="#orgdf6615a">2.3. Konceptuální modely</a></li>
<li><a href="#org98c2917">2.4. Deklarativní modely</a></li>
<li><a href="#org08ddd67">2.5. Funkcionální modely</a></li>
<li><a href="#org8f31cd4">2.6. Modely popsané rovnicemi</a></li>
<li><a href="#org1a593d3">2.7. Prostorové modely</a></li>
<li><a href="#org2c687f2">2.8. Multimodely</a></li>
</ul>
</li>
<li><a href="#org6fd2d14">3. Simulační nástroje</a>
<ul>
<li><a href="#orgd9b300b">3.1. Simulační jazyky</a></li>
</ul>
</li>
<li><a href="#org517e664">4. Modelování náhodných procesů</a>
<ul>
<li><a href="#org4b10900">4.1. Náhodná proměnná</a></li>
<li><a href="#org76927af">4.2. Diskrétní rozdělení pravděpodobnosti</a></li>
<li><a href="#org89b0742">4.3. Diskrétní distribuční funkce</a></li>
<li><a href="#org1c2c0ae">4.4. Distribuční funkce spojité náhodné proměnné</a></li>
<li><a href="#orgd92b1a5">4.5. Hustota pravděpodobnosti spojité náhodné proměnné</a></li>
<li><a href="#org9e78d7c">4.6. Poissonovo rozložení</a></li>
<li><a href="#org42e369e">4.7. Rovnoměrné rozložení</a></li>
<li><a href="#org4ecad57">4.8. Exponenciální rozložení</a></li>
</ul>
</li>
<li><a href="#org7c8a7af">5. Diskrétní simulace</a>
<ul>
<li><a href="#org254ad3b">5.1. Úvod</a></li>
<li><a href="#org647350d">5.2. Petriho sítě</a></li>
<li><a href="#org310f897">5.3. Systémy hromadné obsluhy</a></li>
<li><a href="#org82f8640">5.4. SIMLIB</a></li>
</ul>
</li>
<li><a href="#org4a16ae3">6. Spojitá simulace</a>
<ul>
<li><a href="#org16d480d">6.1. Úvod</a></li>
<li><a href="#org3311713">6.2. Numerické metody</a></li>
<li><a href="#org58ba2ae">6.3. SIMLIB</a></li>
</ul>
</li>
<li><a href="#orgdf95b46">7. Kombinovaná simulace</a>
<ul>
<li><a href="#orgf5f2f7b">7.1. Úvod</a></li>
<li><a href="#org03115f5">7.2. SIMLIB</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-orgc406135" class="outline-2">
<h2 id="orgc406135"><span class="section-number-2">1</span> Úvod</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org3f7681f" class="outline-3">
<h3 id="org3f7681f"><span class="section-number-3">1.1</span> Základní pojmy</h3>
<div class="outline-text-3" id="text-1-1">
</div>
<div id="outline-container-orgfa0e525" class="outline-4">
<h4 id="orgfa0e525"><span class="section-number-4">1.1.1</span> Systém</h4>
<div class="outline-text-4" id="text-1-1-1">
<p>
Je soubor elementárních částí, které mají mezi sebou určíté vazby.
</p>
</div>
</div>
<div id="outline-container-orgb757827" class="outline-4">
<h4 id="orgb757827"><span class="section-number-4">1.1.2</span> Model</h4>
<div class="outline-text-4" id="text-1-1-2">
<p>
Napodobenina systému jiným systémem
</p>
</div>
</div>
<div id="outline-container-orgdd61d3e" class="outline-4">
<h4 id="orgdd61d3e"><span class="section-number-4">1.1.3</span> Modelování</h4>
<div class="outline-text-4" id="text-1-1-3">
<p>
Vyrváření modelů systémů
</p>
</div>
</div>
<div id="outline-container-orgd9b98ff" class="outline-4">
<h4 id="orgd9b98ff"><span class="section-number-4">1.1.4</span> Simulace</h4>
<div class="outline-text-4" id="text-1-1-4">
<p>
Získávání nových znalostí o systémz experimentováním s jeho modelech
</p>
</div>
</div>
</div>

<div id="outline-container-org6933fef" class="outline-3">
<h3 id="org6933fef"><span class="section-number-3">1.2</span> Základní etapy modelování a simulace</h3>
<div class="outline-text-3" id="text-1-2">
<ol class="org-ol">
<li>Vytvoření abstraktního modelu</li>
<li>Vytvoření simulačního modelu</li>
<li>Verifikace a validace</li>
<li>Simulace</li>
<li>Analýza a interpretace výsledků</li>
</ol>
</div>
</div>

<div id="outline-container-orgd7f83cb" class="outline-3">
<h3 id="orgd7f83cb"><span class="section-number-3">1.3</span> Formální definice systému</h3>
<div class="outline-text-3" id="text-1-3">
<p>
Systém \(S\) je dvojice
\[S = (U, R)\]
</p>

<p>
kde:
</p>
</div>
<div id="outline-container-org489828f" class="outline-4">
<h4 id="org489828f"><span class="section-number-4">1.3.1</span> \(U\) je konečná množina prvků systému:</h4>
<div class="outline-text-4" id="text-1-3-1">
<p>
\[U = \{u_1, u_2, \dots, u_N\}\]
</p>
</div>
</div>

<div id="outline-container-org256f0ec" class="outline-4">
<h4 id="org256f0ec"><span class="section-number-4">1.3.2</span> Prvek systému \(u = (X, Y)\):</h4>
<div class="outline-text-4" id="text-1-3-2">
</div>
<ol class="org-ol">
<li><a id="org1077580"></a>\(X\) je množina všech vstupních proměnných<br /></li>
<li><a id="orgec6a96b"></a>\(Y\) je množina všech výstupních proměnných<br /></li>
</ol>
</div>

<div id="outline-container-org9beb117" class="outline-4">
<h4 id="org9beb117"><span class="section-number-4">1.3.3</span> Charakteristika systému \(R\) je množina všech propojení</h4>
<div class="outline-text-4" id="text-1-3-3">
<p>
\[R = \bigcup^{N}_{i,j=1} R_{ij}\]
</p>
</div>
</div>

<div id="outline-container-orgb367a7b" class="outline-4">
<h4 id="orgb367a7b"><span class="section-number-4">1.3.4</span> Propojení prvku \(u_i\) s prvkem \(u_j\):</h4>
<div class="outline-text-4" id="text-1-3-4">
<p>
\[R_{ij} \subseteq Y_i \times X_j\]
</p>
</div>
</div>
</div>

<div id="outline-container-orgbce2aab" class="outline-3">
<h3 id="orgbce2aab"><span class="section-number-3">1.4</span> Čas</h3>
<div class="outline-text-3" id="text-1-4">
<p>
Rozlišujeme tři typy času:
</p>
<ol class="org-ol">
<li>Reálný času
Probíháý skutečný děj v reálném systému</li>
<li>Modelový čas
Časová osa modelu, nemusí být synchronní s reálným časem</li>
<li>Strojový čas
Čas spotřebovaný na výpočet programu</li>
</ol>
</div>
</div>

<div id="outline-container-org9c95e80" class="outline-3">
<h3 id="org9c95e80"><span class="section-number-3">1.5</span> Časová množina</h3>
<div class="outline-text-3" id="text-1-5">
<p>
Množina všech časových okamžiků, ve kterých jsou definovány hodnoty vstupních,
stavových a výstupních proměnných prvku systému
</p>

<p>
Může být diskrétní nebo spojitá<sup><a id="fnr.1" class="footref" href="#fn.1">1</a></sup>
</p>
</div>
</div>

<div id="outline-container-org33a66b1" class="outline-3">
<h3 id="org33a66b1"><span class="section-number-3">1.6</span> Chování systému</h3>
<div class="outline-text-3" id="text-1-6">
<p>
Každému časovému průběhu vstupu přiřazuje časový průběh výstupu. Lze definovat
jako zobrazení.
</p>

<p>
Systémy považujeme za systémy se stejným chováním, vyvolají-li stejné podněty u
obou systémů stejné reakce.
</p>

<p>
Izomorfní systémy jsou systémy, kde prvky systémů navzájem můžeme přiřadit 1:1.
</p>

<p>
Homomorfní systémy jsou systémy, kde prvky systémů navzájem můžeme přiřadit N:1,
ale ne naopak.
</p>
</div>
</div>

<div id="outline-container-org986f611" class="outline-3">
<h3 id="org986f611"><span class="section-number-3">1.7</span> Okolí systému</h3>
<div class="outline-text-3" id="text-1-7">
<p>
Okolí systému zahrnuje vše, co má vliv na chování systému, ale není jeho
součástí.
</p>

<p>
Systémy můžeme rozdělit na uzavřené (nekomunikují s okolím nebo jej zanedbábají)
a otevřene (mají definované vstupy a výstupy).
</p>
</div>
</div>

<div id="outline-container-orgc5a0d2a" class="outline-3">
<h3 id="orgc5a0d2a"><span class="section-number-3">1.8</span> Klasifikace prvků systémů</h3>
<div class="outline-text-3" id="text-1-8">
</div>
