IMS/main.tex
% Created 2019-12-21 Sat 14:59
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\author{Kamil Vojanec}
\date{\today}
\title{Modelování a simulace}
\hypersetup{
 pdfauthor={Kamil Vojanec},
 pdftitle={Modelování a simulace},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 26.3 (Org mode 9.3)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents

\section{Úvod}
\label{sec:org7c899c6}
\subsection{Základní pojmy}
\label{sec:org6010b3b}
\subsubsection{Systém}
\label{sec:org04e1638}
Je soubor elementárních částí, které mají mezi sebou určíté vazby.
\subsubsection{Model}
\label{sec:org0f9109f}
Napodobenina systému jiným systémem
\subsubsection{Modelování}
\label{sec:org5b4882e}
Vyrváření modelů systémů
\subsubsection{Simulace}
\label{sec:org776599c}
Získávání nových znalostí o systémz experimentováním s jeho modelech

\subsection{Základní etapy modelování a simulace}
\label{sec:org8120356}
\begin{enumerate}
\item Vytvoření abstraktního modelu
\item Vytvoření simulačního modelu
\item Verifikace a validace
\item Simulace
\item Analýza a interpretace výsledků
\end{enumerate}

\subsection{Formální definice systému}
\label{sec:orgd2bc696}
Systém \(S\) je dvojice
\[S = (U, R)\]

kde:
\subsubsection{\(U\) je konečná množina prvků systému:}
\label{sec:orga1e0e41}
\[U = \{u_1, u_2, \dots, u_N\}\]

\subsubsection{Prvek systému \(u = (X, Y)\):}
\label{sec:org913f7b5}
\begin{enumerate}
\item \(X\) je množina všech vstupních proměnných
\label{sec:org2e06c6d}
\item \(Y\) je množina všech výstupních proměnných
\label{sec:org784c23c}
\end{enumerate}

\subsubsection{Charakteristika systému \(R\) je množina všech propojení}
\label{sec:org39f3d77}
\[R = \bigcup^{N}_{i,j=1} R_{ij}\]

\subsubsection{Propojení prvku \(u_i\) s prvkem \(u_j\):}
\label{sec:org23b5178}
\[R_{ij} \subseteq Y_i \times X_j\]

\subsection{Čas}
\label{sec:org8edafa0}
Rozlišujeme tři typy času:
\begin{enumerate}
\item Reálný času
Probíháý skutečný děj v reálném systému
\item Modelový čas
Časová osa modelu, nemusí být synchronní s reálným časem
\item Strojový čas
Čas spotřebovaný na výpočet programu
\end{enumerate}

\subsection{Časová množina}
\label{sec:org97e4b41}
Množina všech časových okamžiků, ve kterých jsou definovány hodnoty vstupních,
stavových a výstupních proměnných prvku systému

Může být diskrétní nebo spojitá\footnote{Na číslicovém počítači se vždy diskretizuje}

\subsection{Chování systému}
\label{sec:org7d926d1}
Každému časovému průběhu vstupu přiřazuje časový průběh výstupu. Lze definovat
jako zobrazení.

Systémy považujeme za systémy se stejným chováním, vyvolají-li stejné podněty u
obou systémů stejné reakce.

Izomorfní systémy jsou systémy, kde prvky systémů navzájem můžeme přiřadit 1:1.

Homomorfní systémy jsou systémy, kde prvky systémů navzájem můžeme přiřadit N:1,
ale ne naopak.

\subsection{Okolí systému}
\label{sec:orgabb5218}
Okolí systému zahrnuje vše, co má vliv na chování systému, ale není jeho
součástí.

Systémy můžeme rozdělit na uzavřené (nekomunikují s okolím nebo jej zanedbábají)
a otevřene (mají definované vstupy a výstupy).

\subsection{Klasifikace prvků systémů}
\label{sec:org926e6a0}
