IMS/main.html
<div id="outline-container-orgc4f6914" class="outline-4">
<h4 id="orgc4f6914"><span class="section-number-4">1.8.1</span> Klasifikace 1</h4>
<div class="outline-text-4" id="text-1-8-1">
<p>
Prvky se spojitým chováním vs prvky s diskrétním chováním
</p>
</div>
</div>
<div id="outline-container-orgdc7d149" class="outline-4">
<h4 id="orgdc7d149"><span class="section-number-4">1.8.2</span> Klasifikace 2</h4>
<div class="outline-text-4" id="text-1-8-2">
<p>
Prvky s deterministickým chováním vs prvky s nedeterministickým chováním
</p>
</div>
</div>
</div>

<div id="outline-container-org57181fd" class="outline-3">
<h3 id="org57181fd"><span class="section-number-3">1.9</span> Klasifikace systémů</h3>
<div class="outline-text-3" id="text-1-9">
<p>
Typ systému závisí na typu jeho prvků
</p>
</div>
<div id="outline-container-org049b5d6" class="outline-4">
<h4 id="org049b5d6"><span class="section-number-4">1.9.1</span> Klasifikace 1</h4>
<div class="outline-text-4" id="text-1-9-1">
<p>
Spojité, Diskrétní, Kombinované
</p>
</div>
</div>
<div id="outline-container-orgc8f182c" class="outline-4">
<h4 id="orgc8f182c"><span class="section-number-4">1.9.2</span> Klasifikace 2</h4>
<div class="outline-text-4" id="text-1-9-2">
<p>
Deterministické, nedeterministické
</p>
</div>
</div>
</div>

<div id="outline-container-orgdc46ba1" class="outline-3">
<h3 id="orgdc46ba1"><span class="section-number-3">1.10</span> Simulace</h3>
<div class="outline-text-3" id="text-1-10">
<p>
Cílem simulace je získat nové informace o chování systému v závislosti na
vstupních veličinách a na hodnotách parametrů.
</p>

<p>
Opakovaně vyhodnocujeme model, tak dlouho, dokud nezískáme dostatek informací o
chování systému nebo dokud nenalezneme takové hodnoty parametrů, pro něž má
systém žádané chování.
</p>
</div>
</div>

<div id="outline-container-org43d5f44" class="outline-3">
<h3 id="org43d5f44"><span class="section-number-3">1.11</span> Typy simulace podle modelu</h3>
<div class="outline-text-3" id="text-1-11">
<p>
Spojitá, diskrétní, kombinovaná. Kvalitativní, kvantitativní.
</p>
</div>
</div>

<div id="outline-container-orgf8f5f2a" class="outline-3">
<h3 id="orgf8f5f2a"><span class="section-number-3">1.12</span> Typy simulace podle simulátoru</h3>
<div class="outline-text-3" id="text-1-12">
<p>
Na počítači, real-time, paralelní a distribuovaná
</p>
</div>
</div>

<div id="outline-container-orgca5ec28" class="outline-3">
<h3 id="orgca5ec28"><span class="section-number-3">1.13</span> Verifikace modelu</h3>
<div class="outline-text-3" id="text-1-13">
<p>
Měla by předcházet simulaci. Ověťujeme, zda simulační model odpovídá 1:1
(izomorfně) abstraktnímu modelu.
</p>
</div>
</div>

<div id="outline-container-org06be5ff" class="outline-3">
<h3 id="org06be5ff"><span class="section-number-3">1.14</span> Validace modelu</h3>
<div class="outline-text-3" id="text-1-14">
<p>
Jedná se o jeden z nejobtížnějších problémů modelování. Vyžaduje neustálou
konfrontaci informací a modelovaném systému a dat ze simulovaného systému.
</p>

<p>
Nelze absolutně dokázat přesnost modelu. Pokud chování modelu neodpovídá
předpokládanému chování systému, musíme model modifikovat.
</p>
</div>
</div>
</div>

<div id="outline-container-org55cf6ab" class="outline-2">
<h2 id="org55cf6ab"><span class="section-number-2">2</span> Modely</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org42e844c" class="outline-3">
<h3 id="org42e844c"><span class="section-number-3">2.1</span> Abstraktní model</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Nepostihuje reálný svět v celé komplikovanosti. Zajímá se jen o ohraničené,
vhodně zvolené části. Identifikuje vhodné sloky systému.
</p>

<p>
Pro sestavení abstraktního modelu potřebujeme studovat systém pro určitá
kritéria a závislosti, predikovat chování systému za určirých podmínek,
analyzovat faktory, které jsou pro činnost systému nejvýznamnější a nalézt
takové kombinace parametrů, které vedou k nejlepší odezvě systému.
</p>
</div>
</div>

<div id="outline-container-orgd562cb5" class="outline-3">
<h3 id="orgd562cb5"><span class="section-number-3">2.2</span> Simulační model</h3>
<div class="outline-text-3" id="text-2-2">
<p>
Jedná se o abstraktní model zapsaný formou programu v nějakém programovacím
jazyce.
</p>
</div>
</div>

<div id="outline-container-orgdf6615a" class="outline-3">
<h3 id="orgdf6615a"><span class="section-number-3">2.3</span> Konceptuální modely</h3>
<div class="outline-text-3" id="text-2-3">
<p>
Jejich komponenty zatím nebyly přesně popsány. Používají se v počáteční fázi
modelování pro ujasnění souvislostí a komunikaci v týmu.
</p>

<p>
Má formu textu nebo obrázků.
</p>
</div>
</div>

<div id="outline-container-org98c2917" class="outline-3">
<h3 id="org98c2917"><span class="section-number-3">2.4</span> Deklarativní modely</h3>
<div class="outline-text-3" id="text-2-4">
<p>
Popisuje přechody mezi stavy systému.
</p>

<p>
Je definován stavy a událostmi, které způsobí přechod z jednoho stavu do
druhého.
</p>

<p>
Je vhodný především pro diskrétní modely.
</p>

<p>
Například konečné automaty, petriho sítě.
</p>
</div>
</div>

<div id="outline-container-org08ddd67" class="outline-3">
<h3 id="org08ddd67"><span class="section-number-3">2.5</span> Funkcionální modely</h3>
<div class="outline-text-3" id="text-2-5">
<p>
Grafy zobrazující funkce a proměnné. Uzel grafu je funkce nebo proměnná.
</p>

<p>
Například systémy hromadné obsluhy, bloková schemata, grafy signálových toků.
</p>
</div>
</div>

<div id="outline-container-org8f31cd4" class="outline-3">
<h3 id="org8f31cd4"><span class="section-number-3">2.6</span> Modely popsané rovnicemi</h3>
<div class="outline-text-3" id="text-2-6">
<p>
Používají se algebraické, diferenciální, diferenční rovnice.
</p>

<p>
Mívají podobu neorientovaných grafů.
</p>

<p>
Například elektrická schemata, systémy dravec kořist, kyvadla, logistické
systémy, chaos.
</p>
</div>
</div>

<div id="outline-container-org1a593d3" class="outline-3">
<h3 id="org1a593d3"><span class="section-number-3">2.7</span> Prostorové modely</h3>
<div class="outline-text-3" id="text-2-7">
<p>
Rozdělují systém na prostorově menší ohraničené podsystémy.
</p>

<p>
Například parciální diferenciální rovnice difuze nebo proudění, celulární
automaty, mechanické modely těles.
</p>
</div>
</div>

<div id="outline-container-org2c687f2" class="outline-3">
<h3 id="org2c687f2"><span class="section-number-3">2.8</span> Multimodely</h3>
<div class="outline-text-3" id="text-2-8">
<p>
Složeny z různých typů modelů, obvykle heterogenních.
</p>

<p>
Například kombinované modely, fuzzy modely, propojené simulační systémy.
</p>
</div>
</div>
</div>
<div id="outline-container-org6fd2d14" class="outline-2">
<h2 id="org6fd2d14"><span class="section-number-2">3</span> Simulační nástroje</h2>
<div class="outline-text-2" id="text-3">
<p>
Mohou používat klasické programovací jazyky samy o sobě, nebo s využitím
knihoven. Existují specializované simulační jazyky (Simula67, Modellica&#x2026;)
</p>
</div>

<div id="outline-container-orgd9b300b" class="outline-3">
<h3 id="orgd9b300b"><span class="section-number-3">3.1</span> Simulační jazyky</h3>
<div class="outline-text-3" id="text-3-1">
<p>
Poskytují prostředky usnadňující efektivní popis struktury a chování modelů a
také popis simulačních experimentů.
</p>

<p>
Výhodou je jednodušší popis modelu a možnost automatické kontroly popisu modelu.
</p>

<p>
Nevýhodami jsou náklady na vytvoření překladače, údržbu, výuku&#x2026;
</p>

<p>
Celkově nejsou příliš používány.
</p>
</div>
</div>
</div>

<div id="outline-container-org517e664" class="outline-2">
<h2 id="org517e664"><span class="section-number-2">4</span> Modelování náhodných procesů</h2>
<div class="outline-text-2" id="text-4">
</div>
