IMS/main.tex
\subsubsection{Klasifikace 1}
\label{sec:orgbffac87}
Prvky se spojitým chováním vs prvky s diskrétním chováním
\subsubsection{Klasifikace 2}
\label{sec:org991a254}
Prvky s deterministickým chováním vs prvky s nedeterministickým chováním

\subsection{Klasifikace systémů}
\label{sec:orgac56ac7}
Typ systému závisí na typu jeho prvků
\subsubsection{Klasifikace 1}
\label{sec:org50f6995}
Spojité, Diskrétní, Kombinované
\subsubsection{Klasifikace 2}
\label{sec:orge6d7110}
Deterministické, nedeterministické

\subsection{Simulace}
\label{sec:org89a95a7}
Cílem simulace je získat nové informace o chování systému v závislosti na
vstupních veličinách a na hodnotách parametrů.

Opakovaně vyhodnocujeme model, tak dlouho, dokud nezískáme dostatek informací o
chování systému nebo dokud nenalezneme takové hodnoty parametrů, pro něž má
systém žádané chování.

\subsection{Typy simulace podle modelu}
\label{sec:orgc012bc4}
Spojitá, diskrétní, kombinovaná. Kvalitativní, kvantitativní.

\subsection{Typy simulace podle simulátoru}
\label{sec:orgc85885b}
Na počítači, real-time, paralelní a distribuovaná

\subsection{Verifikace modelu}
\label{sec:orgfd59ab0}
Měla by předcházet simulaci. Ověťujeme, zda simulační model odpovídá 1:1
(izomorfně) abstraktnímu modelu.

\subsection{Validace modelu}
\label{sec:org08bfb94}
Jedná se o jeden z nejobtížnějších problémů modelování. Vyžaduje neustálou
konfrontaci informací a modelovaném systému a dat ze simulovaného systému.

Nelze absolutně dokázat přesnost modelu. Pokud chování modelu neodpovídá
předpokládanému chování systému, musíme model modifikovat.

\section{Modely}
\label{sec:orgfa8fcf7}
\subsection{Abstraktní model}
\label{sec:org9d2a4cc}
Nepostihuje reálný svět v celé komplikovanosti. Zajímá se jen o ohraničené,
vhodně zvolené části. Identifikuje vhodné sloky systému.

Pro sestavení abstraktního modelu potřebujeme studovat systém pro určitá
kritéria a závislosti, predikovat chování systému za určirých podmínek,
analyzovat faktory, které jsou pro činnost systému nejvýznamnější a nalézt
takové kombinace parametrů, které vedou k nejlepší odezvě systému.

\subsection{Simulační model}
\label{sec:org9e82f0b}
Jedná se o abstraktní model zapsaný formou programu v nějakém programovacím
jazyce.

\subsection{Konceptuální modely}
\label{sec:org5571070}
Jejich komponenty zatím nebyly přesně popsány. Používají se v počáteční fázi
modelování pro ujasnění souvislostí a komunikaci v týmu.

Má formu textu nebo obrázků.

\subsection{Deklarativní modely}
\label{sec:org075d155}
Popisuje přechody mezi stavy systému.

Je definován stavy a událostmi, které způsobí přechod z jednoho stavu do
druhého.

Je vhodný především pro diskrétní modely.

Například konečné automaty, petriho sítě.

\subsection{Funkcionální modely}
\label{sec:org98377c2}
Grafy zobrazující funkce a proměnné. Uzel grafu je funkce nebo proměnná.

Například systémy hromadné obsluhy, bloková schemata, grafy signálových toků.

\subsection{Modely popsané rovnicemi}
\label{sec:org9b01199}
Používají se algebraické, diferenciální, diferenční rovnice.

Mívají podobu neorientovaných grafů.

Například elektrická schemata, systémy dravec kořist, kyvadla, logistické
systémy, chaos.

\subsection{Prostorové modely}
\label{sec:org7ff923a}
Rozdělují systém na prostorově menší ohraničené podsystémy.

Například parciální diferenciální rovnice difuze nebo proudění, celulární
automaty, mechanické modely těles.

\subsection{Multimodely}
\label{sec:orge31f870}
Složeny z různých typů modelů, obvykle heterogenních.

Například kombinované modely, fuzzy modely, propojené simulační systémy.
\section{Simulační nástroje}
\label{sec:orgfc9b30f}
Mohou používat klasické programovací jazyky samy o sobě, nebo s využitím
knihoven. Existují specializované simulační jazyky (Simula67, Modellica\ldots{})

\subsection{Simulační jazyky}
\label{sec:org785e86d}
Poskytují prostředky usnadňující efektivní popis struktury a chování modelů a
také popis simulačních experimentů.

Výhodou je jednodušší popis modelu a možnost automatické kontroly popisu modelu.

Nevýhodami jsou náklady na vytvoření překladače, údržbu, výuku\ldots{}

Celkově nejsou příliš používány.

\section{Modelování náhodných procesů}
\label{sec:orgb5c09a2}
