IMS/main.html
<div id="outline-container-org4b10900" class="outline-3">
<h3 id="org4b10900"><span class="section-number-3">4.1</span> Náhodná proměnná</h3>
<div class="outline-text-3" id="text-4-1">
<p>
Náhodná proměnná je taková veličina, která jako výsledek pokusů může nabýt
nějakou hodnotu, přičemž předem nevíme jakou.
</p>

<p>
Rozlišujeme diskrétní a spojité
</p>

<p>
Náhodné veličiny můžeme zadat distribuční funkcí nebo rozdělením
pravděpodobnosti.
</p>
</div>
</div>

<div id="outline-container-org76927af" class="outline-3">
<h3 id="org76927af"><span class="section-number-3">4.2</span> Diskrétní rozdělení pravděpodobnosti</h3>
<div class="outline-text-3" id="text-4-2">
<p>
Určuje vztah mezi možnými hodnotami náhodné veličiny \(x_i\) a jim příslušejícími
pravděpodobnostmi \(p_i = P(X = x_i)\).
</p>

<p>
Obecně platí vztah:
</p>
\begin{equation}
    \sum_{i=1}^\infty p_i = 1
\end{equation}

<p>
Lze definovat například tabulkou pravděpodobnosti pro všechny možné hodnoty
náhodné proměnné, suma všech pravděpodobností musí být 1.
</p>
</div>
</div>

<div id="outline-container-org89b0742" class="outline-3">
<h3 id="org89b0742"><span class="section-number-3">4.3</span> Diskrétní distribuční funkce</h3>
<div class="outline-text-3" id="text-4-3">
<p>
Distribuční funkce náhodné veličiny \(X\) je funkce:
</p>
\begin{equation}
    F(x) = P(X \leq x)
\end{equation}

<p>
Kde $P(X &le; x) je pravděpodobnost toho, že náhodná veličina X nabude hodnoty
menší nebo rovnu zvolenému x.
</p>

<p>
Platí vztah:
</p>
\begin{equation}
    F(x) = \sum_{x_i \leq x} p_i
\end{equation}

<p>
Kraf distribuční funkce pro diskrétní náhodné proměnné je po částech konstantní.
</p>
</div>
</div>

<div id="outline-container-org1c2c0ae" class="outline-3">
<h3 id="org1c2c0ae"><span class="section-number-3">4.4</span> Distribuční funkce spojité náhodné proměnné</h3>
<div class="outline-text-3" id="text-4-4">
\begin{equation}
    F(x) = P(X \leq x) = \int_{-\infty}^x f(x) dx
\end{equation}

<p>
Distribuční fuknce je neklasající. Roste od 0 do &infin;
</p>

<p>
Pravděpodobnost hodnoty \(x\) pro \(a \leq x\) a \(x \leq b\) je rozdíl hodnot
distribuční funkce v bodech \(b\) a \(a\). Vyjádřeno vzorcem:
</p>
\begin{equation}
    P(a \leq X \leq b) = F(b) - F(a)
\end{equation}
</div>
</div>

<div id="outline-container-orgd92b1a5" class="outline-3">
<h3 id="orgd92b1a5"><span class="section-number-3">4.5</span> Hustota pravděpodobnosti spojité náhodné proměnné</h3>
<div class="outline-text-3" id="text-4-5">
<ul class="org-ul">
<li>Vždy větší než 0</li>
<li>Vyjádřena jako derivace distribuční funkce</li>
<li>Integrál funkce hustoty pravděpodobnosti je vždy 1</li>
<li>Hodnota pravděpodobnosti pro \(x\) mezi \(a\) a \(b\) je dána jako intergrál hustota
pravděpodobnosti mezi \(a\) a \(b\)</li>
</ul>
</div>
</div>

<div id="outline-container-org9e78d7c" class="outline-3">
<h3 id="org9e78d7c"><span class="section-number-3">4.6</span> Poissonovo rozložení</h3>
<div class="outline-text-3" id="text-4-6">
<p>
Diskrétní rozložení udávající počet nějakých událostí za jednotku času. Vzorec:
</p>
\begin{equation}
p_i = \frac{\lambda^i}{i!} e^{-\lambda}, \lambda > 0, i \in {0, 1, 2,\dots}
\end{equation}
<p>
Kde \(E(x) = \lambda, D(x) = \lambda\)
</p>
</div>
</div>

<div id="outline-container-org42e369e" class="outline-3">
<h3 id="org42e369e"><span class="section-number-3">4.7</span> Rovnoměrné rozložení</h3>
<div class="outline-text-3" id="text-4-7">
<p>
Označujeme \(R(a, b)\)
</p>

<p>
Hodnota distribuční funkce lineárně roste mezi body \(a\) a \(b\). Hodnota funkce
hustoty pravděpodobnosti je konstatní.
</p>
</div>
</div>

<div id="outline-container-org4ecad57" class="outline-3">
<h3 id="org4ecad57"><span class="section-number-3">4.8</span> Exponenciální rozložení</h3>
<div class="outline-text-3" id="text-4-8">
<p>
Používá se pro dobu mezi dvěma událostmí.
</p>
</div>
</div>
</div>
<div id="outline-container-org7c8a7af" class="outline-2">
<h2 id="org7c8a7af"><span class="section-number-2">5</span> Diskrétní simulace</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-org254ad3b" class="outline-3">
<h3 id="org254ad3b"><span class="section-number-3">5.1</span> Úvod</h3>
</div>
<div id="outline-container-org647350d" class="outline-3">
<h3 id="org647350d"><span class="section-number-3">5.2</span> Petriho sítě</h3>
</div>
<div id="outline-container-org310f897" class="outline-3">
<h3 id="org310f897"><span class="section-number-3">5.3</span> Systémy hromadné obsluhy</h3>
</div>
<div id="outline-container-org82f8640" class="outline-3">
<h3 id="org82f8640"><span class="section-number-3">5.4</span> SIMLIB</h3>
</div>
</div>

<div id="outline-container-org4a16ae3" class="outline-2">
<h2 id="org4a16ae3"><span class="section-number-2">6</span> Spojitá simulace</h2>
<div class="outline-text-2" id="text-6">
</div>
<div id="outline-container-org16d480d" class="outline-3">
<h3 id="org16d480d"><span class="section-number-3">6.1</span> Úvod</h3>
</div>
<div id="outline-container-org3311713" class="outline-3">
<h3 id="org3311713"><span class="section-number-3">6.2</span> Numerické metody</h3>
</div>
<div id="outline-container-org58ba2ae" class="outline-3">
<h3 id="org58ba2ae"><span class="section-number-3">6.3</span> SIMLIB</h3>
</div>
</div>

<div id="outline-container-orgdf95b46" class="outline-2">
<h2 id="orgdf95b46"><span class="section-number-2">7</span> Kombinovaná simulace</h2>
<div class="outline-text-2" id="text-7">
</div>
<div id="outline-container-orgf5f2f7b" class="outline-3">
<h3 id="orgf5f2f7b"><span class="section-number-3">7.1</span> Úvod</h3>
</div>
<div id="outline-container-org03115f5" class="outline-3">
<h3 id="org03115f5"><span class="section-number-3">7.2</span> SIMLIB</h3>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1">1</a></sup> <div class="footpara"><p class="footpara">
Na číslicovém počítači se vždy diskretizuje
</p></div></div>


</div>
</div></div>
<div id="postamble" class="status">
<p class="author">Author: Kamil Vojanec</p>
<p class="date">Created: 2019-12-21 Sat 14:58</p>
</div>
</body>
</html>
