IMS/main.tex
\subsection{Náhodná proměnná}
\label{sec:orgf9a2294}
Náhodná proměnná je taková veličina, která jako výsledek pokusů může nabýt
nějakou hodnotu, přičemž předem nevíme jakou.

Rozlišujeme diskrétní a spojité

Náhodné veličiny můžeme zadat distribuční funkcí nebo rozdělením
pravděpodobnosti.

\subsection{Diskrétní rozdělení pravděpodobnosti}
\label{sec:orge2c187b}
Určuje vztah mezi možnými hodnotami náhodné veličiny \(x_i\) a jim příslušejícími
pravděpodobnostmi \(p_i = P(X = x_i)\).

Obecně platí vztah:
\begin{equation}
    \sum_{i=1}^\infty p_i = 1
\end{equation}

Lze definovat například tabulkou pravděpodobnosti pro všechny možné hodnoty
náhodné proměnné, suma všech pravděpodobností musí být 1.

\subsection{Diskrétní distribuční funkce}
\label{sec:org45694d5}
Distribuční funkce náhodné veličiny \(X\) je funkce:
\begin{equation}
    F(x) = P(X \leq x)
\end{equation}

Kde \$P(X \(\le\) x) je pravděpodobnost toho, že náhodná veličina X nabude hodnoty
menší nebo rovnu zvolenému x.

Platí vztah:
\begin{equation}
    F(x) = \sum_{x_i \leq x} p_i
\end{equation}

Kraf distribuční funkce pro diskrétní náhodné proměnné je po částech konstantní.

\subsection{Distribuční funkce spojité náhodné proměnné}
\label{sec:orgd1bf09b}
\begin{equation}
    F(x) = P(X \leq x) = \int_{-\infty}^x f(x) dx
\end{equation}

Distribuční fuknce je neklasající. Roste od 0 do \(\infty\)

Pravděpodobnost hodnoty \(x\) pro \(a \leq x\) a \(x \leq b\) je rozdíl hodnot
distribuční funkce v bodech \(b\) a \(a\). Vyjádřeno vzorcem:
\begin{equation}
    P(a \leq X \leq b) = F(b) - F(a)
\end{equation}

\subsection{Hustota pravděpodobnosti spojité náhodné proměnné}
\label{sec:org1da2fcd}
\begin{itemize}
\item Vždy větší než 0
\item Vyjádřena jako derivace distribuční funkce
\item Integrál funkce hustoty pravděpodobnosti je vždy 1
\item Hodnota pravděpodobnosti pro \(x\) mezi \(a\) a \(b\) je dána jako intergrál hustota
pravděpodobnosti mezi \(a\) a \(b\)
\end{itemize}

\subsection{Poissonovo rozložení}
\label{sec:orgd954f00}
Diskrétní rozložení udávající počet nějakých událostí za jednotku času. Vzorec:
\begin{equation}
p_i = \frac{\lambda^i}{i!} e^{-\lambda}, \lambda > 0, i \in {0, 1, 2,\dots}
\end{equation}
Kde \(E(x) = \lambda, D(x) = \lambda\)

\subsection{Rovnoměrné rozložení}
\label{sec:orgf57cd50}
Označujeme \(R(a, b)\)

Hodnota distribuční funkce lineárně roste mezi body \(a\) a \(b\). Hodnota funkce
hustoty pravděpodobnosti je konstatní.

\subsection{Exponenciální rozložení}
\label{sec:orga338bfe}
Používá se pro dobu mezi dvěma událostmí.
\section{Diskrétní simulace}
\label{sec:org791c61b}
\subsection{Úvod}
\label{sec:orgf9d3306}
\subsection{Petriho sítě}
\label{sec:org4538d76}
\subsection{Systémy hromadné obsluhy}
\label{sec:orgd63702c}
\subsection{SIMLIB}
\label{sec:orge43e6a1}

\section{Spojitá simulace}
\label{sec:org5bf3891}
\subsection{Úvod}
\label{sec:org0481c6b}
\subsection{Numerické metody}
\label{sec:orgfcc31ff}
\subsection{SIMLIB}
\label{sec:org8aba027}

\section{Kombinovaná simulace}
\label{sec:org184a42c}
\subsection{Úvod}
\label{sec:org0b27a8f}
\subsection{SIMLIB}
\label{sec:org417509e}
\end{document}
